<?xml version="1.0"?>
<net name="model_1" version="11">
	<layers>
		<layer id="1" name="input_1" type="Parameter" version="opset1">
			<data shape="1,3,416,416" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input_1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C,H,W]" />
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="0" name="image_shape" type="Parameter" version="opset1">
			<data shape="1,2" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="image_shape">
					<dim>1</dim>
					<dim>2</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C]" />
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="2" name="Gather_20065" type="Const" version="opset1">
			<data element_type="f32" shape="16, 3, 3, 3" offset="0" size="1728" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Multiply_18672" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_18677" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="1728" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="batch_normalization_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_output_buffer10">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_274" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1792" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="leaky_re_lu_1" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/leaky_re_lu_1/LeakyRelu:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="model_1/leaky_re_lu_1/LeakyRelu:0_pooling" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="same_upper" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/leaky_re_lu_1/LeakyRelu:0_pooling0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Multiply_18771" type="Const" version="opset1">
			<data element_type="f32" shape="32, 16, 3, 3" offset="1796" size="18432" />
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Multiply_18679" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_18684" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="20228" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="batch_normalization_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_output_buffer9">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_280" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1792" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="leaky_re_lu_2" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/leaky_re_lu_2/LeakyRelu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="model_1/leaky_re_lu_2/LeakyRelu:0_pooling" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="same_upper" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/leaky_re_lu_2/LeakyRelu:0_pooling0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Multiply_18780" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 3, 3" offset="20356" size="73728" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Multiply_18686" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_18691" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="94084" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="batch_normalization_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_output_buffer8">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_286" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1792" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="leaky_re_lu_3" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/leaky_re_lu_3/LeakyRelu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="model_1/leaky_re_lu_3/LeakyRelu:0_pooling" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="same_upper" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/leaky_re_lu_3/LeakyRelu:0_pooling0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Multiply_18789" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 3, 3" offset="94340" size="294912" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Multiply_18693" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_18698" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="389252" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="batch_normalization_4" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_output_buffer7">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_292" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1792" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="leaky_re_lu_4" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/leaky_re_lu_4/LeakyRelu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="model_1/leaky_re_lu_4/LeakyRelu:0_pooling" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="same_upper" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/leaky_re_lu_4/LeakyRelu:0_pooling0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Multiply_18798" type="Const" version="opset1">
			<data element_type="f32" shape="256, 128, 3, 3" offset="389764" size="1179648" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Multiply_18700" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_18705" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="1569412" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="batch_normalization_5" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_output_buffer6">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_298" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1792" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="leaky_re_lu_5" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/leaky_re_lu_5/LeakyRelu:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="model_1/leaky_re_lu_5/LeakyRelu:0_pooling" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="same_upper" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>26</dim>
					<dim>26</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/leaky_re_lu_5/LeakyRelu:0_pooling0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Multiply_18807" type="Const" version="opset1">
			<data element_type="f32" shape="512, 256, 3, 3" offset="1570436" size="4718592" />
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Multiply_18707" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_18712" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="6289028" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="batch_normalization_6" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_output_buffer5">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_304" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1792" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="leaky_re_lu_6" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/leaky_re_lu_6/LeakyRelu:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="model_1/leaky_re_lu_6/LeakyRelu:0_pooling" type="MaxPool" version="opset8">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="same_upper" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_1/leaky_re_lu_6/LeakyRelu:0_pooling0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Multiply_18816" type="Const" version="opset1">
			<data element_type="f32" shape="1024, 512, 3, 3" offset="6291076" size="18874368" />
			<output>
				<port id="0" precision="FP32">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Multiply_18714" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_18719" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1024, 1, 1" offset="25165444" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="batch_normalization_7" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_output_buffer4">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_310" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1792" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="leaky_re_lu_7" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/leaky_re_lu_7/LeakyRelu:0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Multiply_18825" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1024, 1, 1" offset="25169540" size="1048576" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Multiply_18721" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_18726" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="26218116" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="batch_normalization_8" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_output_buffer3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_315" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1792" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="leaky_re_lu_8" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/leaky_re_lu_8/LeakyRelu:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Multiply_18834" type="Const" version="opset1">
			<data element_type="f32" shape="512, 256, 3, 3" offset="26219140" size="4718592" />
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Multiply_18728" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_18733" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="30937732" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="batch_normalization_9" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_output_buffer1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_334" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1792" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="leaky_re_lu_9" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_1/leaky_re_lu_9/LeakyRelu:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="conv2d_10/kernel:0" type="Const" version="opset1">
			<data element_type="f32" shape="255, 512, 1, 1" offset="30939780" size="522240" />
			<output>
				<port id="0" precision="FP32" names="conv2d_10/kernel:0">
					<dim>255</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="conv2d_10/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>255</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>255</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Reshape_358" type="Const" version="opset1">
			<data element_type="f32" shape="1, 255, 1, 1" offset="31462020" size="1020" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>255</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="conv2d_10" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>255</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>255</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="convolution_output1">
					<dim>1</dim>
					<dim>255</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_386" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="31463040" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="TFNodes/model_1/conv2d_10/BiasAdd:0" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>255</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TFNodes/model_1/conv2d_10/BiasAdd:0,transpose_output1">
					<dim>1</dim>
					<dim>13</dim>
					<dim>13</dim>
					<dim>255</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__127" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="31463072" size="4" />
			<output>
				<port id="0" precision="I32" names="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__127:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="TFNodes/yolo_evaluation_layer_1/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>13</dim>
					<dim>13</dim>
					<dim>255</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="TFNodes/yolo_evaluation_layer_1/Shape:0,TFNodes/yolo_evaluation_layer_1/Shape_1:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="TFNodes/yolo_evaluation_layer_1/Shape_1__108" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32" names="TFNodes/yolo_evaluation_layer_1/Shape_1__108:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="TFNodes/yolo_evaluation_layer_1/strided_slice_1__109" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="31463076" size="8" />
			<output>
				<port id="0" precision="I64" names="TFNodes/yolo_evaluation_layer_1/strided_slice_1__109:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="TFNodes/yolo_evaluation_layer_1/strided_slice_1__110" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="31463084" size="8" />
			<output>
				<port id="0" precision="I64" names="TFNodes/yolo_evaluation_layer_1/strided_slice_1__110:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="TFNodes/yolo_evaluation_layer_1/strided_slice_1__112" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="31463076" size="8" />
			<output>
				<port id="0" precision="I64" names="TFNodes/yolo_evaluation_layer_1/strided_slice_1__112">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="TFNodes/yolo_evaluation_layer_1/strided_slice_1" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32" names="TFNodes/yolo_evaluation_layer_1/strided_slice_1:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="TFNodes/yolo_evaluation_layer_1/strided_slice_6__122" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="31463092" size="8" />
			<output>
				<port id="0" precision="I64" names="TFNodes/yolo_evaluation_layer_1/strided_slice_6__122">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="TFNodes/yolo_evaluation_layer_1/strided_slice_6__123" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="31463076" size="8" />
			<output>
				<port id="0" precision="I64" names="TFNodes/yolo_evaluation_layer_1/strided_slice_6__123">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="TFNodes/yolo_evaluation_layer_1/strided_slice_6__125" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="31463076" size="8" />
			<output>
				<port id="0" precision="I64" names="TFNodes/yolo_evaluation_layer_1/strided_slice_6__125">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="TFNodes/yolo_evaluation_layer_1/strided_slice_6" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32" names="TFNodes/yolo_evaluation_layer_1/strided_slice_6:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_1150" type="Const" version="opset1">
			<data element_type="u64" shape="1" offset="31463092" size="8" />
			<output>
				<port id="0" precision="U64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="TFNodes/yolo_evaluation_layer_1/strided_slice_6__126" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="U64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="TFNodes/yolo_evaluation_layer_1/strided_slice_6__126:0" />
			</output>
		</layer>
		<layer id="81" name="Constant_1152" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="31463092" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__128" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__128:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="TFNodes/yolo_evaluation_layer_1/strided_slice_7__117" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="31463076" size="8" />
			<output>
				<port id="0" precision="I64" names="TFNodes/yolo_evaluation_layer_1/strided_slice_7__117">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="TFNodes/yolo_evaluation_layer_1/strided_slice_7__118" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="31463100" size="8" />
			<output>
				<port id="0" precision="I64" names="TFNodes/yolo_evaluation_layer_1/strided_slice_7__118">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="TFNodes/yolo_evaluation_layer_1/strided_slice_7__120" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="31463076" size="8" />
			<output>
				<port id="0" precision="I64" names="TFNodes/yolo_evaluation_layer_1/strided_slice_7__120">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="TFNodes/yolo_evaluation_layer_1/strided_slice_7" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32" names="TFNodes/yolo_evaluation_layer_1/strided_slice_7:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_1155" type="Const" version="opset1">
			<data element_type="u64" shape="1" offset="31463092" size="8" />
			<output>
				<port id="0" precision="U64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="TFNodes/yolo_evaluation_layer_1/strided_slice_7__121" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="U64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="TFNodes/yolo_evaluation_layer_1/strided_slice_7__121:0" />
			</output>
		</layer>
		<layer id="89" name="Constant_1157" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="31463092" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__129" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__129:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__130" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="31463108" size="4" />
			<output>
				<port id="0" precision="I32" names="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__130:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__131" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="31463112" size="4" />
			<output>
				<port id="0" precision="I32" names="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Unsqueeze__131:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Concat__132" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
				<port id="4" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I32" names="TFNodes/yolo_evaluation_layer_1/Reshape_3/shape_Concat__132:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="TFNodes/yolo_evaluation_layer_1/Reshape_3__200" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="TFNodes/yolo_evaluation_layer_1/Reshape_3__200:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="TFNodes/yolo_evaluation_layer_1/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>13</dim>
					<dim>13</dim>
					<dim>255</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="TFNodes/yolo_evaluation_layer_1/Reshape_3:0">
					<dim>1</dim>
					<dim>13</dim>
					<dim>13</dim>
					<dim>3</dim>
					<dim>85</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_14003" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="31463116" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_14006" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="31463156" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_14009" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="31463196" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="TFNodes/yolo_evaluation_layer_1/strided_slice_8" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1, 1, 0" end_mask="1, 1, 1, 1, 0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>13</dim>
					<dim>13</dim>
					<dim>3</dim>
					<dim>85</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
				<port id="2" precision="I64">
					<dim>5</dim>
				</port>
				<port id="3" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="TFNodes/yolo_evaluation_layer_1/strided_slice_8:0">
					<dim>1</dim>
					<dim>13</dim>
					<dim>13</dim>
					<dim>3</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="TFNodes/yolo_evaluation_layer_1/Sigmoid" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>13</dim>
					<dim>13</dim>
					<dim>3</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="TFNodes/yolo_evaluation_layer_1/Sigmoid:0">
					<dim>1</dim>
					<dim>13</dim>
					<dim>13</dim>
					<dim>3</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="TFNodes/yolo_evaluation_layer_1/strided_slice_4__143" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="31463076" size="8" />
			<output>
				<port id="0" precision="I64" names="TFNodes/yolo_evaluation_layer_1/strided_slice_4__143">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="TFNodes/yolo_evaluation_layer_1/strided_slice_4__144" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="31463100" size="8" />
			<output>
				<port id="0" precision="I64" names="TFNodes/yolo_evaluation_layer_1/strided_slice_4__144">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="TFNodes/yolo_evaluation_layer_1/strided_slice_4__146" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="31463076" size="8" />
			<output>
				<port id="0" precision="I64" names="TFNodes/yolo_evaluation_layer_1/strided_slice_4__146">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="TFNodes/yolo_evaluation_layer_1/strided_slice_4" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32" names="TFNodes/yolo_evaluation_layer_1/strided_slice_4:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_874" type="Const" version="opset1">
			<data element_type="u64" shape="1" offset="31463092" size="8" />
			<output>
				<port id="0" precision="U64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="TFNodes/yolo_evaluation_layer_1/strided_slice_4__147" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="U64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="TFNodes/yolo_evaluation_layer_1/arange_1__148_diff__149:0,TFNodes/yolo_evaluation_layer_1/strided_slice_4__147:0" />
			</output>
		</layer>
		<layer id="107" name="TFNodes/yolo_evaluation_layer_1/arange_1__148_cast_diff" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32" />
			</input>
			<output>
				<port id="1" precision="FP32" names="TFNodes/yolo_evaluation_layer_1/arange_1__148_cast_diff:0,TFNodes/yolo_evaluation_layer_1/arange_1__148_div:0" />
			</output>
		</layer>
		<layer id="108" name="TFNodes/yolo_evaluation_layer_1/arange_1__148_ceil" type="Ceiling" version="opset1">
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="FP32" names="TFNodes/yolo_evaluation_layer_1/arange_1__148_ceil:0" />
			</output>
		</layer>
		<layer id="109" name="TFNodes/yolo_evaluation_layer_1/arange_1__148_trip_cnt" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="I64" names="TFNodes/yolo_evaluation_layer_1/arange_1__148_trip_cnt:0" />
			</output>
		</layer>
		<layer id="110" name="TFNodes/yolo_evaluation_layer_1/arange_1__148_cond" type="Const" version="opset1">
			<data element_type="boolean" shape="" offset="31463236" size="1" />
			<output>
				<port id="0" precision="BOOL" names="TFNodes/yolo_evaluation_layer_1/arange_1__148_cond" />
			</output>
		</layer>
		<layer id="111" name="TFNodes/yolo_evaluation_layer_1/arange_1/start:0" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="31463237" size="4" />
			<output>
				<port id="0" precision="I32" names="TFNodes/yolo_evaluation_layer_1/arange_1/start:0" />
			</output>
		</layer>
		<layer id="112" name="TFNodes/yolo_evaluation_layer_1/arange_1__148_loop" type="Loop" version="opset5">
			<port_map>
				<input external_port_id="2" internal_layer_id="0" />
				<output external_port_id="3" internal_layer_id="7" />
				<output axis="0" external_port_id="4" internal_layer_id="4" start="0" end="-1" stride="1" part_size="1" />
				<input external_port_id="-1" internal_layer_id="1" purpose="current_iteration" />
				<output external_port_id="-1" internal_layer_id="9" purpose="execution_condition" />
			</port_map>
			<back_edges>
				<edge from-layer="7" to-layer="0" />
			</back_edges>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="BOOL" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32" names="TFNodes/yolo_evaluation_layer_1/arange_1__148_loop:0" />
				<port id="4" precision="I32" names="TFNodes/yolo_evaluation_layer_1/arange_1__148_loop:1">
					<dim>13</dim>
				</port>
			</output>
			<body>
				<layers>
					<layer id="1" name="i" type="Parameter" version="opset1">
						<data shape="" element_type="i64" />
						<rt_info>
							<attribute name="fused_names" version="0" value="i" />
						</rt_info>
						<output>
							<port id="0" precision="I64" names="i" />
						</output>
					</layer>
					<layer id="0" name="range" type="Parameter" version="opset1">
						<data shape="" element_type="i32" />
						<rt_info>
							<attribute name="fused_names" version="0" value="range" />
						</rt_info>
						<output>
							<port id="0" precision="I32" names="prev,range" />
						</output>
					</layer>
					<layer id="2" name="Constant_888" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="31463092" size="8" />
						<rt_info>
							<attribute name="fused_names" version="0" value="Constant_888" />
						</rt_info>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="3" name="Unsqueeze_889" type="Unsqueeze" version="opset1">
						<rt_info>
							<attribute name="fused_names" version="0" value="Unsqueeze_889" />
						</rt_info>
						<input>
							<port id="0" precision="I32" />
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="I32">
								<dim>1</dim>
							</port>
						</output>
